<?php
/**
 * Created by PhpStorm.
 * User: Максим
 * Date: 28.02.2017
 * Time: 20:41
 */
//Домашнее задание №3
//
//Задание #1
//Создайте систему регистрации и авторизации. Регистрационные данные должны быть записаны в базе данных с шифрованием.
//Выберите метод шифрования самостоятельно, на основе данных с вебинаров.
//Для авторизации вы можете использовать cookies или механизм сессий.
//Создайте форму, в которой будут иметься поле для ввода имени, возраста и описания о себе. Поля не могут содержать HTML код
//Добавьте поле “фотография”, которое загрузит файл с картинкой. Все остальные типы файлы не должны быть загружены.
//Файл поместите в папку “photos”, а остальные поля сохраните в базу данных
//Добавьте функциональность вывода списка файлов в директории “photos”, иметь возможность удаления и переименования файлов,
//с занесением обновлений в БД
//Доступ ко всему функционалу доступен только авторизованному пользователю.

echo "<h3>Задание #1</h3>";